Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: List of link:https://github.com/redhat-developer/service-binding-operator#known-bindable-operators[List of bindable Operators]
ja_jp: link:https://github.com/redhat-developer/service-binding-operator#known-bindable-operators[List of bindable Operators] の一覧

source: List of signature algorithms. Set it to `ES256` to support the Elliptic Curve signature algorithm.
ja_jp: 署名アルゴリズムのリスト。楕円曲線署名アルゴリズムをサポートするには、 `ES256` に設定します。

source: List of supported security events
ja_jp: サポートされているセキュリティイベントのリスト

source: List open client connections
ja_jp: 開いているクライアント接続をリスト表示する

source: List open connections
ja_jp: 開いている接続をリスト表示する

source: List the CA certificate on Windows by using the Powershell terminal with administrator rights:
ja_jp: 管理者権限で Powershell ターミナルを使用して、Windows 上の CA 証明書をリスト表示します。

source: List the Kubernetes services.
ja_jp: Kubernetesサービスをリストアップします。

source: List the extensions required by this project
ja_jp: このプロジェクトに必要なエクステンションを一覧表示します。

source: List the image streams created.
ja_jp: 作成されたイメージストリームを一覧表示します。

source: List the pods associated with your current OpenShift project.
ja_jp: 現在の OpenShift プロジェクトに関連するポッドを一覧表示します。

source: List the pods associated with your current {openshift} project:
ja_jp: 現在の {openshift} プロジェクトに関連するポッドを一覧表示します：

source: Listen to OIDC events
ja_jp: OIDC イベントのリスニング

source: Listener name for lookup. Clients can use listenerName to choose one of the listeners as the service URL to create a connection to the broker as long as the network is accessible."advertisedListeners" must enabled in broker side.
ja_jp: ルックアップするリスナー名。クライアントは、ネットワークがアクセス可能である限り、 listenerName を使用して、ブローカーへの接続を作成するサービス URL としてリスナーのいずれかを選択できます。"advertisedListeners" はブローカー側で有効になっている必要があります。

source: Listening for startup and shutdown events
ja_jp: スタートアップとシャットダウンのイベントをリッスンする

source: Listening on a Random Port
ja_jp: ランダムポートでの待ち受け

source: Listening on a Unix domain socket allows us to dispense with the overhead of TCP if the connection to the quarkus service is established from the same host. This can happen if access to the service goes through a proxy which is often the case if you're setting up a service mesh with a proxy like Envoy.
ja_jp: Unixドメインソケットでリスニングすることにより、quarkusサービスへの接続が同じホストから確立されている場合、TCPのオーバーヘッドを省略することができます。これは、サービスへのアクセスがプロキシを経由する場合に起こります。Envoyのようなプロキシを使ってサービスメッシュを設定している場合によく見られます。

source: Listening to a Unix Domain Socket
ja_jp: Unixドメインソケットのリスニング

source: Listening to important authentication events
ja_jp: 重要な認証イベントのリッスン

source: Listing Extensions for a Quarkus project
ja_jp: Quarkus プロジェクトのエクステンションの一覧表示

source: Listing Extensions for a Quarkus release
ja_jp: Quarkus リリースのエクステンションの一覧表示

source: Listing and creating topics
ja_jp: トピックの一覧表示と作成

source: Listing extensions
ja_jp: エクステンションの一覧表示

source: Listing extensions for a Quarkus project
ja_jp: Quarkusプロジェクトのエクステンションのリストアップ

source: Listing extensions for a Quarkus release
ja_jp: Quarkusリリースのエクステンションのリストアップ

source: Listing extensions for a specific offering
ja_jp: 特定のオファリングのエクステンションのリスト表示

source: Listing plugins
ja_jp: プラグインをリストアップ

source: Lists
ja_jp: リスト

source: Lists all HTTP endpoints (REST, GraphQL, internal, etc.). Helps you inspect available routes in your app.
ja_jp: すべての HTTP エンドポイント (REST、GraphQL、内部など) を一覧表示します。アプリケーション内の利用可能なルートを検査するのに役立ちます。

source: Lists allowed HTTP methods for cross-origin requests.
ja_jp: クロスオリジンリクエストに使用可能な HTTP メソッドを表示します。

source: Lists the image streams created.
ja_jp: 作成されたイメージストリームの一覧を取得します。

source: Lists the image streams created. The image stream of our application should be tagged as <project>/openshift-quickstart:1.0.0-SNAPSHOT.
ja_jp: 作成されたイメージ・ストリームを一覧表示します。私たちのアプリケーションのイメージ・ストリームは、<project>/openshift-quickstart:1.0.0-SNAPSHOT としてタグ付けされるべきです。

source: Literal
ja_jp: リテラル

source: Live Coding
ja_jp: ライブコーディング

source: Live Coding and Simulating AWS Lambda Environment Locally
ja_jp: AWS Lambda 環境のローカルでのライブコーディングとシミュレーション

source: Live Coding and Unit/Integration Testing
ja_jp: ライブコーディングおよび単体/統合テスト

source: Live Coding with Quarkus
ja_jp: Quarkus でのライブコーディング

source: Live Coding with Quarkus also proved extremely useful when developing the application:
ja_jp: また、Quarkusを使ったライブコーディングは、アプリケーションの開発に非常に役立ちました。

source: Live Reload in Development
ja_jp: 開発時のライブリロード

source: Live coding:: for our `quarkus:dev` capability
ja_jp: Live coding:: `quarkus:dev` 機能について

source: Live reload
ja_jp: ライブ・リロード

source: Live reload is generally triggered by a HTTP request, however not all applications are HTTP applications and some extensions may want to trigger live reload based on other events. To do this you need to implement `io.quarkus.dev.spi.HotReplacementSetup` in your runtime module, and add a `META-INF/services/io.quarkus.dev.spi.HotReplacementSetup` that lists your implementation.
ja_jp: しかし、すべてのアプリケーションがHTTPアプリケーションであるとは限らず、エクステンションによっては他のイベントに基づいてライブリロードをトリガしたい場合もあります。これを実現するには、実行時モジュールで `io.quarkus.dev.spi.HotReplacementSetup` を実装し、その実装をリストアップする `META-INF/services/io.quarkus.dev.spi.HotReplacementSetup` を追加する必要があります。

source: Live reload is generally triggered by an HTTP request, however not all applications are HTTP applications and some extensions may want to trigger live reload based on other events. To do this you need to implement `io.quarkus.dev.spi.HotReplacementSetup` in your runtime module, and add a `META-INF/services/io.quarkus.dev.spi.HotReplacementSetup` that lists your implementation.
ja_jp: しかし、すべてのアプリケーションがHTTPアプリケーションであるとは限らず、エクステンションによっては他のイベントに基づいてライブリロードをトリガしたい場合もあります。これを実現するには、実行時モジュールで `io.quarkus.dev.spi.HotReplacementSetup` を実装し、その実装をリストアップする `META-INF/services/io.quarkus.dev.spi.HotReplacementSetup` を追加する必要があります。

source: Live reload of static OpenAPI document is supported during development. A modification to your OpenAPI document will be picked up on fly by Quarkus.
ja_jp: 開発中は、静的なOpenAPIドキュメントのライブリロードがサポートされています。OpenAPIドキュメントへの変更は、Quarkusによって起動中にピックアップされます。

source: Livecoding just made everything better
ja_jp: Livecodingで全てが良くなりました

source: Liveness health check
ja_jp: Liveness ヘルスチェック

source: Liveness health check. Also available at `/q/health/live` endpoint.
ja_jp: Liveness ヘルスチェック。 `/q/health/live` エンドポイントでも利用可能。

source: Load Script format
ja_jp: ロードスクリプトフォーマット

source: Load Shedding reference guide
ja_jp: 負荷制限リファレンスガイド

source: Load balancer implementation consists of three elements:
ja_jp: ロードバランサーの実装は3つの要素で構成されています:

source: Load scripts
ja_jp: スクリプトのロード

source: Load shedding is the practice of detecting service overload and rejecting requests.
ja_jp: 負荷制限とは、サービスの過負荷を検出し、リクエストを拒否する処理のことです。

source: Load shedding is the practice of detecting service overload and rejecting requests. By rejecting requests when overloaded, load shedding keeps the application alive. With priority load shedding, the application even keeps working, albeit in a degraded state: only a fraction of requests is handled, others are rejected early. You should consider using it if your application runs in a dynamic environment with a real risk of getting overloaded and is not fronted by another service that sheds load already.
ja_jp: 負荷制限は、サービスの過負荷を検出し、リクエストを拒否する手法です。過負荷時にリクエストを拒否することで、負荷制限はアプリケーションを稼働させ続けます。優先負荷制限を使用すると、アプリケーションは機能低下した状態であっても稼働し続けます。つまり、リクエストの一部のみが処理され、残りは早期に拒否されます。アプリケーションが過負荷になる実際の危険性がある動的な環境で実行されており、すでに負荷制限を行う他のサービスが前面にない場合に、これを使用することを検討する必要があります。

source: Load-balancing connections
ja_jp: ロードバランシングコネクション

source: Loading
ja_jp: ロード中

source: Loading OpenAPI Schema From Static Files
ja_jp: 静的ファイルからの OpenAPI スキーマのロード

source: Loading the time zone database
ja_jp: タイムゾーンデータベースのロード

source: Loading the zone rules
ja_jp: ゾーンルールのロード

source: Loads a method result from the cache without executing the method body whenever possible.
ja_jp: 可能な限り、メソッドボディを実行せずにキャッシュからメソッドの結果を読み込みます。

source: Local IP address
ja_jp: ローカル IP アドレス

source: Local Logout
ja_jp: ローカルログアウト

source: Local Public Key
ja_jp: ローカル公開鍵

source: Local Verification
ja_jp: ローカル検証

source: Local Verification or Introspection
ja_jp: ローカル検証またはイントロスペクション

source: Local filesystem static resources
ja_jp: ローカルファイルシステムの静的リソース

source: Local logout
ja_jp: ローカルログアウト

source: Local path scanning
ja_jp: ローカルパススキャン

source: Local port
ja_jp: ローカルポート

source: Local proxy for dev mode
ja_jp: 開発モードのローカルプロキシー

source: Local public key
ja_jp: ローカル公開鍵

source: Local server name
ja_jp: ローカルサーバー名

source: Local storage is useful to remember user preferences or state. For example, the footer remembers the state (open/close) and the size when open of the bottom drawer.
ja_jp: ローカルストレージは、ユーザーの好みや状態を記憶するのに便利です。例えば、フッターは一番下の引き出しの状態（開閉）と開いたときのサイズを記憶しています。

source: Local verification
ja_jp: ローカル検証

source: Local verification or introspection
ja_jp: ローカル検証もしくはイントロスペクション

source: Local verification properties
ja_jp: ローカル検証プロパティー

source: Local vs. Downloaded `protoc`
ja_jp: ローカルとダウンロードされた `protoc` の比較

source: Locale (Change to another supported language/locale)
ja_jp: ロケール (別のサポートされている言語/ロケールに変更)

source: Localization
ja_jp: ローカライゼーション

source: Localized File Example - `msg_de.properties`
ja_jp: ローカライズされたファイルの例 - `msg_de.properties`

source: Localized Interface Example
ja_jp: ローカライズされたインターフェースの例

source: Locate the source files for Quarkus docs
ja_jp: Quarkus docsのソースファイルの場所を確認する。

source: Location of a private key used to sign the claims when either a no-argument `sign()` or `innerSign()` method is called.
ja_jp: 引数なしの `sign()` または `innerSign()` メソッドが呼び出されたときにクレームに署名するために使用される秘密鍵の場所です。

source: Location of a private key which will be used to sign the claims when either a no-argument `sign()` or `innerSign()` method is called.
ja_jp: 引数なし `sign()` または `innerSign()` メソッドが呼び出されたときに、クレームに署名するために使用される秘密鍵の場所。

source: Location of a public key which will be used to encrypt the claims or inner JWT when a no-argument `encrypt()` method is called.
ja_jp: 引数無し `encrypt()` メソッドが呼び出された際に、クレームまたは内部 JWT を暗号化するために使用される公開鍵の位置。

source: Location of the public key used to encrypt claims or the inner JWT when the no-argument `encrypt()` method is called.
ja_jp: 引数なしの `encrypt()` メソッドが呼び出されたときに、クレームまたは内部 JWT を暗号化するために使用される公開鍵の場所です。

source: Location of the verification key which can point to both public and secret keys. Secret keys can only be in the JWK format. Note that 'mp.jwt.verify.publickey.location' will be ignored if this property is set.
ja_jp: 公開鍵と秘密鍵の両方を指すことができる検証鍵の場所。秘密鍵は JWK 形式でのみ使用できます。このプロパティーが設定されている場合、'mp.jwt.verify.publickey.location' は無視されることに注意してください。

source: Location of the verification key, which can point to both public and secret keys. Secret keys can only be in the JWK format. Note that 'mp.jwt.verify.publickey.location' is ignored if this property is set.
ja_jp: 公開鍵と秘密鍵の両方を指すことができる検証鍵の場所。秘密鍵は JWK 形式でのみ使用できます。このプロパティーが設定されている場合、'mp.jwt.verify.publickey.location' は無視されることに注意してください。

source: Locations
ja_jp: ロケーション

source: Lock management
ja_jp: ロック管理

source: Log Docker into your ECR registry and push the Docker image to it
ja_jp: Docker を ECR レジストリーへの Docker のログインと Docker イメージのプッシュ

source: Log Handlers
ja_jp: ログハンドラー

source: Log In - OpenShift CLI Example
ja_jp: ログイン - OpenShift CLIの例

source: Log In - OpenShift CLI With API Token Example
ja_jp: ログイン - APIトークンを使用したOpenShift CLIの例

source: Log Into the OpenShift Cluster
ja_jp: OpenShift クラスターへのログイン

source: Log REST Client request and response data.
ja_jp: REST クライアントのリクエストとレスポンスのデータをログに記録します。

source: Log authentication and authorization failures
ja_jp: 認証と認可の失敗をログに記録する

source: Log file rotation ensures effective log file management over time by maintaining a specified number of backup log files, while keeping the primary log file up-to-date and manageable.
ja_jp: ログファイルのローテーションは、プライマリログファイルを最新かつ管理しやすい状態に保ちながら、指定された数のバックアップログファイルを維持することにより、長期間にわたる効果的なログファイル管理を保証します。

source: Log file rotation ensures efficient log management by preserving a specified number of backup files while keeping the primary log file up to date and manageable in size.
ja_jp: ログファイルのローテーションは、指定された数のバックアップファイルを保持しながら、プライマリログファイルを最新の状態かつ管理可能なサイズに保つことで、効率的なログ管理を可能にします。

source: Log file rotation ensures efficient log management by preserving a specified number of backup files while keeping the primary log file updated and at a manageable size.
ja_jp: ログファイルのローテーションにより、主要なログファイルを最新の状態に保ち、管理可能なサイズに保ちながら、一定数のバックアップファイルを保持することで、効率的なログ管理が実現します。

source: Log handlers
ja_jp: ログハンドラー

source: Log handlers (like the console log handler) can have a link:https://docs.oracle.com/en/java/javase/11/docs/api/java.logging/java/util/logging/Filter.html[filter] associated with them, whose purpose is to determine whether a record should actually be logged or not.
ja_jp: ログハンドラ（コンソールログハンドラのような）は、レコードが実際にログに記録されるべきかどうかを決定する目的で、それらに関連する link:https://docs.oracle.com/en/java/javase/11/docs/api/java.logging/java/util/logging/Filter.html[フィルタ] を持つことができます。

source: Log handlers, such as the console log handler, can be linked with a link:https://docs.oracle.com/en/java/javase/11/docs/api/java.logging/java/util/logging/Filter.html[filter] that determines whether a log record should be logged.
ja_jp: コンソールログハンドラーのようなログハンドラーは、ログレコードがログに記録されるべきかどうかを決定する link:https://docs.oracle.com/en/java/javase/11/docs/api/java.logging/java/util/logging/Filter.html[フィルタ] とリンクさせることができます。

source: Log handlers, such as the console log handler, can be linked with a link:https://docs.oracle.com/en/java/javase/17/docs/api/java.logging/java/util/logging/Filter.html[filter] that determines whether a log record should be logged.
ja_jp: コンソールログハンドラのようなログハンドラは、ログレコードがログに記録されるべきかどうかを決定する link:https://docs.oracle.com/en/java/javase/17/docs/api/java.logging/java/util/logging/Filter.html[フィルタ] とリンクすることができます。

source: Log in as `admin`, with the password, `admin`. This user has both `admin` and `user` roles.
ja_jp: パスワード `admin` を使用して、 `admin` としてログインします。このユーザーには、 `admin` と `user` の両方の役割があります。

source: Log in as `alice` (password: `alice`), who has a `user` role.
ja_jp: `user` ロールを持つ `alice` (パスワード: `alice`) としてログインします。

source: Log in as `alice` (password: `alice`), who only has a `User Permission` to access the `/api/users/me` resource:
ja_jp: `/api/users/me` リソースにアクセスするための `User Permission` のみを持つ `alice` (パスワード: `alice`) としてログインします。

source: Log in as `alice`, with the password, `alice`. This user has both `admin` and `user` roles.
ja_jp: `alice` としてログインします。パスワード `alice` を使用します。 このユーザーには `admin` と `user` の両方のロールがあります。

source: Log in as the `admin` user to access the Keycloak Administration Console. The password is `admin`.
ja_jp: Keycloak 管理コンソールにアクセスするには、 `admin` ユーザーとしてログインします。 パスワードは `admin` です。

source: Log in as the `admin` user to access the Keycloak Administration Console. Username should be `admin` and password `admin`.
ja_jp: Keycloak 管理コンソールにアクセスするには、 `admin` ユーザーとしてログインしてください。ユーザー名は `admin` 、パスワードは `admin` です。

source: Log in as the `admin` user to access the Keycloak administration console. The username and password are both `admin`.
ja_jp: Keycloak 管理コンソールにアクセスするには、`admin` ユーザーとしてログインします。 ユーザー名とパスワードは両方とも `admin` です。

source: Log in to the Keycloak Administration Console by using the following credentials:
ja_jp: 次の認証情報を使用して、Keycloak Administration Console にログインします。

source: Log in to the Keycloak admin console. The username and password are both `admin`.
ja_jp: Keycloak 管理コンソールにログインします。 ユーザー名とパスワードは両方とも `admin` です。

source: Log in to the `oc` tool:
ja_jp: `oc` ツールにログインします：

source: Log is a much older concept and is still widely used in the industry, that's why the overview table from above has different columns for logs and events.
ja_jp: ログは非常に古い概念であり、今でも業界で広く使われています。そのため、上記の概要表ではログとイベントに異なる列があります。

source: Log levels used by Quarkus
ja_jp: Quarkusが使用するログレベル

source: Log out and back in as `alice` with the password, `alice`. This user has a `user` role.
ja_jp: ログアウトし、パスワード `alice` を使用して `alice` として再度ログインします。 このユーザーには `user` ロールがあります。

source: Log out and back in as `bob` with the password, `bob`. This user has a `user` role.
ja_jp: ログアウトし、パスワード `bob` を使用して `bob` として再度ログインします。 このユーザーには `user` ロールがあります。

source: Log out and log in again as `admin` (password: `admin`), who has both `admin` and `user` roles.
ja_jp: ログアウトし、`admin` と `user` の両方のロールを持つ `admin` (パスワード: `admin`) として再度ログインします。

source: Log out and log in as `admin` (password: `admin`), who has both `Admin Permission` to access the `/api/admin` resource and `User Permission` to access the `/api/users/me` resource:
ja_jp: ログアウトし、 `admin` としてログインします (パスワード: `admin`)。 `admin` は、 `/api/admin` リソースにアクセスするための `Admin Permission` と、 `/api/users/me` リソースにアクセスするための `User Permission` の両方を持っています。

source: Log rotation
ja_jp: ログローテーション

source: Log4j 1.x is no longer supported by Quarkus.
ja_jp: Log4j 1.x は Quarkus でサポートされなくなりました。

source: Logging
ja_jp: ロギング

source: Logging API
ja_jp: ロギング API

source: Logging Adapters
ja_jp: ロギングアダプター

source: Logging Format
ja_jp: ログフォーマット

source: Logging Quarkus application build classpath tree
ja_jp: Quarkus アプリケーションのビルドクラスパスのツリーのログ取得

source: Logging and events
ja_jp: ロギングとイベント

source: Logging categories
ja_jp: ロギングカテゴリ

source: Logging configuration
ja_jp: ロギング設定

source: Logging configuration reference
ja_jp: ロギング設定リファレンス

source: Logging entries from all appenders can be sent by using OpenTelemetry Logging.
ja_jp: OpenTelemetry Logging を使用することで、すべてのアペンダーからのログエントリを送信できます。

source: Logging exporter
ja_jp: Logging エクスポーター

source: Logging exporter (for debugging)
ja_jp: Logging エクスポーター (デバッグ用)

source: Logging filters
ja_jp: ロギングフィルタ

source: Logging format
ja_jp: ロギングフォーマット

source: Logging in Quarkus now has a Panache flavor which allows you to eliminate logger related boilerplate code. See the link:/guides/logging[logging guide] for details.
ja_jp: QuarkusのロギングにPanacheのフレーバーが加わり、ロガー関連の定型的なコードを排除することができるようになりました。詳しくは、 link:/guides/logging[ロギングガイド]をご覧ください。

source: Logging in to an {openshift} cluster
ja_jp: {openshift} クラスタへのログイン

source: Logging is configured on a per-category basis, with each category being configured independently. Configuration for a category applies recursively to all subcategories unless there is a more specific subcategory configuration.
ja_jp: ログはカテゴリごとに設定され、各カテゴリは独立して設定されます。 カテゴリの設定は、より具体的なサブカテゴリの設定がない限り、すべてのサブカテゴリに再帰的に適用されます。

source: Logging is configured per category. Configuration for a category applies recursively to all subcategories unless a more specific subcategory configuration exists.
ja_jp: ロギングはカテゴリーごとに設定されます。あるカテゴリーの設定は、より具体的なサブカテゴリーの設定が存在しない限り、すべてのサブカテゴリーに再帰的に適用されます。

source: Logging is done on a per-category basis. Each category can be independently configured. A configuration which applies to a category will also apply to all sub-categories of that category, unless there is a more specific matching sub-category configuration. For every category the same settings that are configured on ( console / file / syslog ) apply. These can also be overridden by attaching a one or more named handlers to a category. See example in <<category-named-handlers-example>>
ja_jp: ロギングはカテゴリごとに行われます。各カテゴリは独立して設定することができます。あるカテゴリに適用される設定は、より特定の一致するサブカテゴリの設定がない限り、そのカテゴリのすべてのサブカテゴリにも適用されます。すべてのカテゴリに対して、( console / file / syslog ) で設定されているのと同じ設定が適用されます。これらの設定は、1つ以上の名前付きハンドラーをカテゴリにアタッチすることで上書きすることもできます。 link:#category-named-handlers-example[category-named-handlers-example]] の例を参照してください。

source: Logging levels
ja_jp: ログレベル

source: Logging traffic
ja_jp: トラフィックの記録

source: Logging with Native Image
ja_jp: ネイティブイメージでのロギング

source: Logical AND Operator
ja_jp: 論理 AND 演算子

source: Logical AND Operator: `&&`
ja_jp: 論理 AND 演算子: `&&`

source: Logical OR Operator
ja_jp: 論理 OR 演算子

source: Logical OR Operator: `||`
ja_jp: 論理 OR 演算子: `||`

source: Login as `alice` (password: `alice`) who has a `user` role
ja_jp: `user` のロールを持つ `alice` (パスワード: `alice`) としてログインします

source: Login as `alice` (password: `alice`) who only has a `User Permission` to access the `/api/users/me` resource
ja_jp: `/api/users/me` リソースへのアクセス `User Permission` のみを持つ `alice` (パスワード: `alice`) としてログインします。

source: Login credentials are the same for most databases, except when the database requirements don't allow it:
ja_jp: ログイン認証情報は、データベースの要件で許可されていない場合を除き、ほとんどのデータベースで同じです。

source: Login to Azure
ja_jp: Azureへのログイン

source: Login to Google Cloud
ja_jp: Google Cloud にログイン

source: Login to Google Cloud is necessary for deploying the application and it can be done as follows:
ja_jp: アプリケーションのデプロイにはGoogle Cloudへのログインが必要で、以下のように行います。

source: Login to Google Cloud is necessary for deploying the application. It can be done as follows:
ja_jp: アプリケーションのデプロイには Google Cloud へのログインが必要で、以下のように行うことが出来ます:

source: Logo
ja_jp: ロゴマーク

source: Logout
ja_jp: ログアウト

source: Logout and expiration
ja_jp: ログアウトと有効期限

source: Logout and login as `admin` (password: `admin`) who has both `Admin Permission` to access the `/api/admin` resource and `User Permission` to access the `/api/users/me` resource
ja_jp: `/api/admin` リソースにアクセスするための `Admin Permission` と `/api/users/me` リソースにアクセスするための `User Permission` の両方を持っている `admin` (パスワード: `admin`)としてログアウトし、ログインします。

source: Logout and login as `admin` (password: `admin`) who has both `admin` and `user` roles
ja_jp: ログアウトし、 `admin` と `user` ロールの両方を持つ `admin` (パスワード: `admin`) としててログインします

source: Logout extra params
ja_jp: ログアウト追加パラメーター

source: Logout mode
ja_jp: ログアウトモード

source: Logout path
ja_jp: ログアウトパス

source: Logout support
ja_jp: ログアウトのサポート

source: Logs
ja_jp: ログ

source: Logs are disabled by default at *build* time because they are experimental.
ja_jp: ログは実験的なものなので、 *ビルド* 時にはデフォルトで無効になっています。

source: Logs are disabled by default at *build* time because they are tech preview.
ja_jp: ログはテクニカルプレビューであるため、*ビルド時* にデフォルトで無効になっています。

source: Logs output
ja_jp: ログ出力

source: Logstash comes by default with an Input plugin that can understand the GELF format, we will first create a pipeline that enables this plugin.
ja_jp: LogstashにはGELF形式を理解できるInputプラグインがデフォルトで入ってるので、まずこのプラグインを有効にするパイプラインを作成します。

source: Long Form
ja_jp: 長い形式

source: Long lock times
ja_jp: 長いロック時間

source: Long story short: we investigated and we improved. A lot.
ja_jp: 手短に言えば、私たちは調査し、大幅に改善しました。

source: Look at the return type; it returns a `Uni` of `List<Fruit>`. `Uni` is an asynchronous type. It's a bit like a future. It's a placeholder that will get its value (item) later. When it receives the item (Mutiny says it _emits_ its item), you can attach some behavior. That's how we express the continuation: get a uni, and when the uni emits its item, execute the rest of the processing.
ja_jp: 戻り値の型を見てください。これは `List<Fruit>` の `Uni` を返します。 `Uni` は非同期型です。これはfutureのようなものです。これは後で値（アイテム）を得るためのプレースホルダーです。アイテムを受け取ったら（Mutinyではアイテムを _emit_すると言っています）、何らかの動作を付けることができます。Uniを取得し、そのUniがアイテムをemitしたら、残りの処理を実行する、という継続を表現しています。

source: Look at the xref:web-dependency-locator.adoc[Web dependency locator] guide for details on how to use https://www.webjars.org[WebJars], https://mvnpm.org[mvnpm] and https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script/type/importmap[importmaps]
ja_jp: https://www.webjars.org[WebJars]、https://mvnpm.org[mvnpm]、https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script/type/importmap[importmaps] の使用方法の詳細は、xref:web-dependency-locator.adoc[Web 依存関係ロケーター] ガイドを参照してください。

source: Look for `http_server_requests_seconds_count`, `http_server_requests_seconds_sum`, and `http_server_requests_seconds_max` in the output.
ja_jp: 出力で、 `http_server_requests_seconds_count`、 `http_server_requests_seconds_sum`、 `http_server_requests_seconds_max` を探します。

source: Look for a config.xml classpath resource
ja_jp: config.xml クラスパスリソースを探します。

source: Look for a constructor annotated with `@ProjectedConstructor` This is the most explicit and preferred way to indicate which constructor should be used.
ja_jp: `@ProjectedConstructor` アノテーションが付けられたコンストラクターを探します。これが、どのコンストラクターを使用すべきかを示す最も明示的で推奨される方法です。

source: Look for parameters annotated with `@ProjectedFieldName`
ja_jp: `@ProjectedFieldName` アノテーションが付けられたパラメーターを探します。
